{
    "aboutMe": "About Me",
    "hi": "Hi, I am a",
    "jobTitle": "Software Engineer",
    "aboutDesc1": "Dedicated to web development and related technologies.",
    "aboutDesc2": "Started programming at III(Institute for Information Industry), wrote my first 'Hello World' like many others, and have been learning and growing ever since. I am excited to create useful things and solve problems.",
    "aboutDesc3": "Skilled in backend development with <strong>Java, C#</strong>, and frontend development with frameworks like <strong>React, Vue.js</strong>. I enjoy teamwork, am proactive and responsible, quickly understand requirements, visualize and verbalize complex logic, and turn them into <strong>task lists</strong> to help me plan and develop efficiently.",
    "workExperience": "Work Experience",
    "job1Title": "Backend Engineer",
    "job1Company": "Viainno Co., Ltd.",
    "job1List": [
        "Responsible for full-stack development, focusing on backend C# (.NET 8.0) RESTful API, implementing core business logic and system integration.",
        "Participated in database planning and design, using MS-SQL Server to ensure data efficiency, integrity, and security.",
        "Assisted frontend team with Vue 3, Tailwind CSS, introduced Vite for performance, and closely collaborated on API design.",
        "Collaborated with app engineers for API integration and testing, ensuring data transmission and system stability.",
        "Used locking and explicit transaction control in community finance systems to solve concurrency issues, improving consistency and stability.",
        "Adopted agile development, participated in daily standups, improving team communication and project efficiency."
    ],
    "job2Title": "Full Stack Engineer",
    "job2Company": "Sundial Technology Solution Co., Ltd.",
    "job2List": [
        "Used Eclipse and Spring Tool Suite for backend, refactored traditional SpringMVC to microservices.",
        "Designed and implemented web apps embeddable in mobile apps, frontend with Angular, backend with Spring Boot.",
        "Developed internal systems, designed React modules for attendance, leave, and workflow management, optimizing admin processes."
    ],
    "job3Title": "Backend Engineer",
    "job3Company": "Hitrust Co., Ltd.",
    "job3List": [
        "Developed and maintained multiple mobile and corporate banking features, responsible for module design, scheduling, message integration, and database operations.",
        "Developed red envelope feature for mobile banking, designed payment APIs, integrated internal systems and TWD transaction flows.",
        "Used Java, Spring Boot, Hibernate, JDBC/HQL/SQL for data access, and Git for version control."
    ],
    "skills": "Skills",
    "backend": "Backend",
    "backendSkills": "ASP.NET Core, C#, Spring Boot, Spring MVC, Java, Node.js",
    "frontend": "Frontend",
    "frontendSkills": "jQuery, Vue.js, React, Angular, JavaScript",
    "database": "Database",
    "databaseSkills": "SQL Server, MS SQL, MySQL, PostgreSQL, Oracle",
    "versionControl": "Version Control",
    "versionControlSkills": "Git, GitHub, GitLab",
    "language": "Language",
    "languageSkills": "Chinese (native), English (proficient)",
    "home": "Home",
    "articles": "Articles",
    "about": "About",
    "heroHeadline": "Hi~ I'm Ray Sun",
    "heroDescription": "I have years of backend development experience, specializing in system architecture design and API development, with strong skills in database modeling and performance tuning. I am proactive and responsible, able to quickly understand requirements, visualize and verbalize complex logic, and turn them into actionable task lists for efficient and accurate development.",
    "heroSubheadline": "web developer",
    "projectsTitle": "Projects",
    "githubAchievements": "School Achievements",
    "toeic": "TOEIC Blue Certificate 795",
    "scholarship": "Multiple Semester Scholarships",
    "secondPlace": "2nd place in the department for the entire academic year"
}